Terraform output showing test repo being created with main branch as default:
```Terraform will perform the following actions:

  # module.terraform_github_module_test.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "main"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "test-github-module-change"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.terraform_github_module_test.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "main"
      + id         = (known after apply)
      + repository = "test-github-module-change"
    }

  # module.terraform_github_module_test.github_branch_protection.main will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = false
      + id                     = (known after apply)
      + pattern                = "main"
      + repository_id          = (known after apply)
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.terraform_github_module_test.github_repository.main will be created
  + resource "github_repository" "main" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "testing change for terraform github module"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = true
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "test-github-module-change"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "github",
          + "terraform",
        ]
      + visibility             = "private"

      + template {
          + owner      = "trussworks"
          + repository = "test-github-module-change"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.```